public class Lei_One {
    public static void main(String[] args) {
        /**
         类和对象知识点(第一天)
         什么是面向对象:
         什么是类:类是对现实生活中一类具有共同属性(变量),和共同行为(方法)的事物的抽象
            属性:对象具有的各种特征,每个对象的每个属性都有特定的值
            行为:对象能够执行的操作

         类和对象的区别
            类:类是对现实生活中一类具有共同属性(变量),和共同行为(方法)的事物的抽象
            对象:是能够看得到摸得到的真实物体
         类是对象的抽象--对象是类的实体(意思就是类是一个整体的功能,是抽象的,只能自己去想象,对象相当于是类中的实体)
         比如(类):手机是一个类,但是手机有很多种,把它当做成一个大类,相当于分类--这就是类的含义
         比如(对象):手机中要有很多种手机品牌,比如:小米手机、华为手机、苹果手机,这些品牌手机就是对象,真实存在的
         */
    }
}
