/*
 类的定义
 语法结构:
    [修饰符列表] class 类名{
 
 }
 定义一个学生类
 状态信息:
 姓名(String)
 学号(int)
 年龄(boolean)
 地址(String)
 
 动作信息:
 吃饭
 上课
 玩耍
 唱歌
 跳舞
 重点:属性(状态信息)通常是采用一个变量的形式来完成定义的
 */
public class LeiTest01{//Java语言当中所有的.class都属于引用数据类型(意思就是可以被其他的调用的数据类型)
    //属性(以下描述的是对象状态信息)
    //属性(状态信息)通常是采用一个变量的形式来完成定义的
    //在类体当中方法体之外的变量被称为"成员变量":成员变量没有赋值的时候，系统默认为0
    //学号
    int no;
    //姓名
    String name;
    //性别
    boolean sex;
    //年龄
    int age;
    //住址
    String adddrss;
    
    //方法
    //方法描述的是对象的动作信息
    
}
