public class IF_three {
    public static void main(String[] args) {
        /**
         if语句格式3
         格式:
         if(关系表达式){
         语句体1
         }else if(关系表达式2){
         语句体2
         }
         ......
         else{
         语句体3
         }
         执行流程:
         首先计算关系表达式1的值
         如果关系表达式的值结果为true,就执行语句体1,如果关系表达式的值结果为false,就计算关系表达式2的值
         如果关系表达式2的值结果是true,就执行语句体2,如果关系表达式的值结果为false,就计算关系表达式3的值
         ........
         如果没有任何关系表达式结果是true,就执行else下的语句体(语句体3)
         */

    }
}
